advanced-concepts/03_kustomize/README.org
* Kustomize basics

  Run ~kustomize build~ and take a look at the resources that ~kustomize~ is going to build

  #+begin_src sh
kustomize build base/
  #+end_src

  Apply the base application

  #+begin_src sh
kustomize build base/ | oc apply -f -
  #+end_src

  You could also run

  #+begin_src
oc apply -k build/
  #+end_src

  as ~oc~ and ~kubectl~ already bundle a version of kustomize

  |-----------------------------------------------------------------------------------------------------------------------------------|
  | :exclamation: The version bundled with oc or kubectl of kustomize is rather old. If there are any problems use kustomize directly |
  |-----------------------------------------------------------------------------------------------------------------------------------|

  Use ~curl~ to test the deployed nginx instance

  #+begin_src sh
ROUTE=$(oc get route nginx -o jsonpath={.spec.host})
curl -v "$ROUTE"
  #+end_src

** Overlays

   Now lets try to use the overlay

   #+begin_src sh
kustomize build overlays/training/
   #+end_src

   Try do create the resources with kustomize:

   #+begin_src sh
kustomize build overlays/training/ | oc apply -f
   #+end_src

   What is the status of the nginx pods?

   What happens if you use curl to test the application again?

* Cleanup

  Execute:

  #+begin_src sh
../../utils/cleanup.sh
  #+end_src
